API's/CodeIgniter/apirest-ci-classment/app/Controllers/Login.php

    public function index()
    {
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'prueba@gmail.com'
 LIMIT 1