API's/CodeIgniter/apirest-ci-classment/app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users = new UserModel;

        return $this->respond(['users' => $users->findAll()], 200);